In [1]:
import pandas as pd

In [3]:
arr={"category":["Math","Eng","hindi"], "student_1":[40,60,80], "student_2":[20,30,40]}

In [7]:
df=pd.DataFrame(arr, index=['subject_1','subject_2','subject_3'])

In [8]:
df

          category  student_1  student_2
subject_1     Math         40         20
subject_2      Eng         60         30
subject_3    hindi         80         40

In [10]:
df.transpose()

          subject_1 subject_2 subject_3
category       Math       Eng     hindi
student_1        40        60        80
student_2        20        30        40